package packa;

/*
包与包之间类出现继承关系时的特点：

不同包中的子类具备了一个特殊的权限就是protected。

子类可以直接访问不同包中父类的被保护的方法。



包与包之间可以使用的权限只有两个。
public
protected：只有不同包中的子类可以直接访问。




           private   default   protected    public
------------------------------------------------------
同一类中     ok        ok          ok         ok
------------------------------------------------------
同一包中               ok          ok         ok
------------------------------------------------------
子类                               ok         ok
------------------------------------------------------
不同包中                                      ok
------------------------------------------------------
*/
public class  DemoA extends packb.DemoB
{
	public void show()
	{
		System.out.println("demo a run");
		func();
	}
}
